t0biasm/embedded-project/platforms/c2000/mcal/f28p65/code/pin_map.h
//###########################################################################
//
// FILE:   pin_map.h
//
// TITLE:  Definitions of pin mux info for gpio.c.
//
//###########################################################################
// 
// C2000Ware v6.00.00.00
//
// Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

#ifndef __PIN_MAP_H__
#define __PIN_MAP_H__

//*****************************************************************************
// 0x00000003 = MUX register value
// 0x0000000C = GMUX register value
// 0x0000FF00 = Shift amount within mux registers
// 0xFFFF0000 = Offset of MUX register
//*****************************************************************************


#define GPIO_0_GPIO0                    0x00060000U
#define GPIO_0_EPWM1_A                  0x00060001U
#define GPIO_0_CLB_OUTPUTXBAR1          0x00060005U
#define GPIO_0_I2CA_SDA                 0x00060006U
#define GPIO_0_EMIF1_A13                0x00060009U
#define GPIO_0_ESC_GPI0                 0x0006000AU
#define GPIO_0_FSITXA_D0                0x0006000DU

#define GPIO_1_GPIO1                    0x00060200U
#define GPIO_1_EPWM1_B                  0x00060201U
#define GPIO_1_CLB_OUTPUTXBAR2          0x00060205U
#define GPIO_1_I2CA_SCL                 0x00060206U
#define GPIO_1_EMIF1_A14                0x00060209U
#define GPIO_1_ESC_GPI1                 0x0006020AU
#define GPIO_1_FSITXA_D1                0x0006020DU

#define GPIO_2_GPIO2                    0x00060400U
#define GPIO_2_EPWM2_A                  0x00060401U
#define GPIO_2_OUTPUTXBAR1              0x00060405U
#define GPIO_2_I2CB_SDA                 0x00060406U
#define GPIO_2_UARTA_TX                 0x00060407U
#define GPIO_2_EMIF1_A15                0x00060409U
#define GPIO_2_ESC_GPI2                 0x0006040AU
#define GPIO_2_FSITXA_CLK               0x0006040DU

#define GPIO_3_GPIO3                    0x00060600U
#define GPIO_3_EPWM2_B                  0x00060601U
#define GPIO_3_OUTPUTXBAR2              0x00060602U
#define GPIO_3_I2CB_SCL                 0x00060606U
#define GPIO_3_UARTA_RX                 0x00060607U
#define GPIO_3_ESC_GPI3                 0x0006060AU
#define GPIO_3_FSIRXA_D0                0x0006060DU

#define GPIO_4_GPIO4                    0x00060800U
#define GPIO_4_EPWM3_A                  0x00060801U
#define GPIO_4_OUTPUTXBAR3              0x00060805U
#define GPIO_4_CANA_TX                  0x00060806U
#define GPIO_4_MCANA_TX                 0x00060809U
#define GPIO_4_ESC_GPI4                 0x0006080AU
#define GPIO_4_FSIRXA_D1                0x0006080DU

#define GPIO_5_GPIO5                    0x00060A00U
#define GPIO_5_EPWM3_B                  0x00060A01U
#define GPIO_5_OUTPUTXBAR3              0x00060A03U
#define GPIO_5_CLB_OUTPUTXBAR3          0x00060A05U
#define GPIO_5_CANA_RX                  0x00060A06U
#define GPIO_5_MCANA_RX                 0x00060A09U
#define GPIO_5_ESC_GPI5                 0x00060A0AU
#define GPIO_5_FSIRXA_CLK               0x00060A0DU

#define GPIO_6_GPIO6                    0x00060C00U
#define GPIO_6_EPWM4_A                  0x00060C01U
#define GPIO_6_OUTPUTXBAR4              0x00060C02U
#define GPIO_6_EXTSYNCOUT               0x00060C03U
#define GPIO_6_EQEP3_A                  0x00060C05U
#define GPIO_6_MCANB_TX                 0x00060C06U
#define GPIO_6_LINA_TX                  0x00060C07U
#define GPIO_6_EMIF1_DQM0               0x00060C09U
#define GPIO_6_ESC_GPI6                 0x00060C0AU
#define GPIO_6_FSITXB_D0                0x00060C0DU

#define GPIO_7_GPIO7                    0x00060E00U
#define GPIO_7_EPWM4_B                  0x00060E01U
#define GPIO_7_OUTPUTXBAR5              0x00060E03U
#define GPIO_7_EQEP3_B                  0x00060E05U
#define GPIO_7_MCANB_RX                 0x00060E06U
#define GPIO_7_LINA_RX                  0x00060E07U
#define GPIO_7_EMIF1_DQM1               0x00060E09U
#define GPIO_7_ESC_GPI7                 0x00060E0AU
#define GPIO_7_FSITXB_D1                0x00060E0DU

#define GPIO_8_GPIO8                    0x00061000U
#define GPIO_8_EPWM5_A                  0x00061001U
#define GPIO_8_EMIF1_RAS                0x00061002U
#define GPIO_8_ADCSOCAO                 0x00061003U
#define GPIO_8_EQEP3_STROBE             0x00061005U
#define GPIO_8_SCIA_TX                  0x00061006U
#define GPIO_8_CLB_OUTPUTXBAR4          0x00061007U
#define GPIO_8_MCANA_TX                 0x00061009U
#define GPIO_8_ESC_GPO0                 0x0006100AU
#define GPIO_8_FSITXB_CLK               0x0006100DU
#define GPIO_8_FSITXA_D1                0x0006100EU
#define GPIO_8_FSIRXA_D0                0x0006100FU

#define GPIO_9_GPIO9                    0x00061200U
#define GPIO_9_EPWM5_B                  0x00061201U
#define GPIO_9_SCIB_TX                  0x00061202U
#define GPIO_9_OUTPUTXBAR6              0x00061203U
#define GPIO_9_EQEP3_INDEX              0x00061205U
#define GPIO_9_SCIA_RX                  0x00061206U
#define GPIO_9_ESC_GPO1                 0x0006120AU
#define GPIO_9_FSIRXB_D0                0x0006120DU
#define GPIO_9_FSITXA_D0                0x0006120EU
#define GPIO_9_FSIRXA_CLK               0x0006120FU

#define GPIO_10_GPIO10                  0x00061400U
#define GPIO_10_EPWM6_A                 0x00061401U
#define GPIO_10_EMIF1_CAS               0x00061402U
#define GPIO_10_ADCSOCBO                0x00061403U
#define GPIO_10_EQEP1_A                 0x00061405U
#define GPIO_10_SCIB_TX                 0x00061406U
#define GPIO_10_SD4_C1                  0x00061407U
#define GPIO_10_MCANA_RX                0x00061409U
#define GPIO_10_CLB_OUTPUTXBAR5         0x0006140AU
#define GPIO_10_ESC_TX0_DATA0           0x0006140BU
#define GPIO_10_FSIRXB_D1               0x0006140DU
#define GPIO_10_FSITXA_CLK              0x0006140EU
#define GPIO_10_FSIRXA_D1               0x0006140FU

#define GPIO_11_GPIO11                  0x00061600U
#define GPIO_11_EPWM6_B                 0x00061601U
#define GPIO_11_SCIB_RX                 0x00061602U
#define GPIO_11_OUTPUTXBAR7             0x00061603U
#define GPIO_11_EQEP1_B                 0x00061605U
#define GPIO_11_SD4_D1                  0x00061607U
#define GPIO_11_ESC_GPO3                0x0006160AU
#define GPIO_11_ESC_TX0_DATA1           0x0006160BU
#define GPIO_11_FSIRXB_CLK              0x0006160DU
#define GPIO_11_FSIRXA_D1               0x0006160EU
#define GPIO_11_PMBUSA_ALERT            0x0006160FU

#define GPIO_12_GPIO12                  0x00061800U
#define GPIO_12_EPWM7_A                 0x00061801U
#define GPIO_12_CLB_OUTPUTXBAR6         0x00061802U
#define GPIO_12_ADCSOCAO                0x00061803U
#define GPIO_12_EQEP1_STROBE            0x00061805U
#define GPIO_12_SCIA_TX                 0x00061806U
#define GPIO_12_SD4_C2                  0x00061807U
#define GPIO_12_EMIF1_A1                0x00061809U
#define GPIO_12_ESC_GPO4                0x0006180AU
#define GPIO_12_ESC_TX0_DATA2           0x0006180BU
#define GPIO_12_FSIRXC_D0               0x0006180DU
#define GPIO_12_FSIRXA_D0               0x0006180EU
#define GPIO_12_PMBUSA_CTL              0x0006180FU

#define GPIO_13_GPIO13                  0x00061A00U
#define GPIO_13_EPWM7_B                 0x00061A01U
#define GPIO_13_CLB_OUTPUTXBAR7         0x00061A02U
#define GPIO_13_EQEP5_STROBE            0x00061A03U
#define GPIO_13_EQEP1_INDEX             0x00061A05U
#define GPIO_13_SCIA_RX                 0x00061A06U
#define GPIO_13_SD4_D2                  0x00061A07U
#define GPIO_13_EMIF1_CS0N              0x00061A09U
#define GPIO_13_ESC_GPO5                0x00061A0AU
#define GPIO_13_ESC_TX0_DATA3           0x00061A0BU
#define GPIO_13_FSIRXC_D1               0x00061A0DU
#define GPIO_13_FSIRXA_CLK              0x00061A0EU
#define GPIO_13_PMBUSA_SDA              0x00061A0FU

#define GPIO_14_GPIO14                  0x00061C00U
#define GPIO_14_EPWM8_A                 0x00061C01U
#define GPIO_14_SCIB_TX                 0x00061C02U
#define GPIO_14_EQEP5_INDEX             0x00061C03U
#define GPIO_14_LINA_TX                 0x00061C05U
#define GPIO_14_OUTPUTXBAR3             0x00061C06U
#define GPIO_14_OUTPUTXBAR8             0x00061C07U
#define GPIO_14_ESC_GPO6                0x00061C0AU
#define GPIO_14_ESC_PHY1_LINKSTATUS     0x00061C0BU
#define GPIO_14_FSIRXC_CLK              0x00061C0DU
#define GPIO_14_EMIF1_D17               0x00061C0EU
#define GPIO_14_PMBUSA_SCL              0x00061C0FU

