t0biasm/embedded-project/platforms/c2000/mcal/f28p65/code/pin_map.h
#define GPIO_78_GPIO78                  0x00861C00U
#define GPIO_78_EPWM10_A                0x00861C01U
#define GPIO_78_EMIF1_D6                0x00861C02U
#define GPIO_78_EQEP2_A                 0x00861C06U
#define GPIO_78_SD3_C2                  0x00861C07U
#define GPIO_78_SD4_D4                  0x00861C0AU
#define GPIO_78_SD2_C4                  0x00861C0DU
#define GPIO_78_ESC_RX0_DV              0x00861C0EU

#define GPIO_79_GPIO79                  0x00861E00U
#define GPIO_79_EPWM10_B                0x00861E01U
#define GPIO_79_EMIF1_D5                0x00861E02U
#define GPIO_79_ERRORSTS                0x00861E05U
#define GPIO_79_EQEP2_B                 0x00861E06U
#define GPIO_79_SD3_D2                  0x00861E07U
#define GPIO_79_SD2_D1                  0x00861E0DU
#define GPIO_79_ESC_RX0_ERR             0x00861E0EU

#define GPIO_80_GPIO80                  0x00880000U
#define GPIO_80_EPWM11_A                0x00880001U
#define GPIO_80_EMIF1_D4                0x00880002U
#define GPIO_80_ERRORSTS                0x00880005U
#define GPIO_80_EQEP2_STROBE            0x00880006U
#define GPIO_80_SD3_C3                  0x00880007U
#define GPIO_80_SD1_D4                  0x0088000AU
#define GPIO_80_SD2_C1                  0x0088000DU
#define GPIO_80_ESC_RX0_DATA0           0x0088000EU

#define GPIO_81_GPIO81                  0x00880200U
#define GPIO_81_EPWM11_B                0x00880201U
#define GPIO_81_EMIF1_D3                0x00880202U
#define GPIO_81_EQEP2_INDEX             0x00880206U
#define GPIO_81_SD3_D3                  0x00880207U
#define GPIO_81_ESC_RX0_DATA1           0x0088020EU

#define GPIO_82_GPIO82                  0x00880400U
#define GPIO_82_EPWM12_A                0x00880401U
#define GPIO_82_EMIF1_D2                0x00880402U
#define GPIO_82_SD3_C2                  0x0088040DU
#define GPIO_82_ESC_RX0_DATA2           0x0088040EU

#define GPIO_83_GPIO83                  0x00880600U
#define GPIO_83_EPWM12_B                0x00880601U
#define GPIO_83_EMIF1_D1                0x00880602U
#define GPIO_83_SD3_D2                  0x0088060DU
#define GPIO_83_ESC_RX0_DATA3           0x0088060EU

#define GPIO_84_GPIO84                  0x00880800U
#define GPIO_84_EPWM12_B                0x00880801U
#define GPIO_84_EMIF1_D1                0x00880802U
#define GPIO_84_EMIF1_CS4N              0x00880803U
#define GPIO_84_SCIA_TX                 0x00880805U
#define GPIO_84_EQEP6_A                 0x00880806U
#define GPIO_84_SD3_D2                  0x00880809U
#define GPIO_84_UARTA_TX                0x0088080BU
#define GPIO_84_SD3_C2                  0x0088080DU
#define GPIO_84_ESC_TX0_ENA             0x0088080EU
#define GPIO_84_ESC_RX0_DATA3           0x0088080FU

#define GPIO_85_GPIO85                  0x00880A00U
#define GPIO_85_EPWM13_A                0x00880A01U
#define GPIO_85_EMIF1_D0                0x00880A02U
#define GPIO_85_SCIA_RX                 0x00880A05U
#define GPIO_85_EQEP6_B                 0x00880A06U
#define GPIO_85_SD3_D1                  0x00880A07U
#define GPIO_85_UARTA_RX                0x00880A0BU
#define GPIO_85_SD3_D3                  0x00880A0DU
#define GPIO_85_ESC_TX0_CLK             0x00880A0EU
#define GPIO_85_EMIF1_DQM2              0x00880A0FU

#define GPIO_86_GPIO86                  0x00880C00U
#define GPIO_86_EPWM13_B                0x00880C01U
#define GPIO_86_EMIF1_A13               0x00880C02U
#define GPIO_86_EMIF1_CAS               0x00880C03U
#define GPIO_86_SCIB_TX                 0x00880C05U
#define GPIO_86_EQEP6_STROBE            0x00880C06U
#define GPIO_86_SD3_C3                  0x00880C0DU
#define GPIO_86_ESC_PHY0_LINKSTATUS     0x00880C0EU

#define GPIO_87_GPIO87                  0x00880E00U
#define GPIO_87_EPWM14_A                0x00880E01U
#define GPIO_87_EMIF1_A14               0x00880E02U
#define GPIO_87_EMIF1_RAS               0x00880E03U
#define GPIO_87_SCIB_RX                 0x00880E05U
#define GPIO_87_EQEP6_INDEX             0x00880E06U
#define GPIO_87_EMIF1_DQM3              0x00880E09U
#define GPIO_87_SD3_D4                  0x00880E0DU
#define GPIO_87_ESC_TX0_DATA0           0x00880E0EU

#define GPIO_88_GPIO88                  0x00881000U
#define GPIO_88_EPWM14_B                0x00881001U
#define GPIO_88_EMIF1_A15               0x00881002U
#define GPIO_88_EMIF1_DQM0              0x00881003U
#define GPIO_88_EMIF1_DQM1              0x00881009U
#define GPIO_88_SD3_C4                  0x0088100DU
#define GPIO_88_ESC_TX0_DATA1           0x0088100EU

#define GPIO_89_GPIO89                  0x00881200U
#define GPIO_89_EPWM15_A                0x00881201U
#define GPIO_89_EMIF1_A16               0x00881202U
#define GPIO_89_EMIF1_DQM1              0x00881203U
#define GPIO_89_SD1_D3                  0x00881207U
#define GPIO_89_EMIF1_CAS               0x00881209U
#define GPIO_89_SD4_D1                  0x0088120DU
#define GPIO_89_ESC_TX0_DATA2           0x0088120EU
#define GPIO_89_SPID_PTE                0x0088120FU

#define GPIO_90_GPIO90                  0x00881400U
#define GPIO_90_EPWM15_B                0x00881401U
#define GPIO_90_EMIF1_A17               0x00881402U
#define GPIO_90_EMIF1_DQM2              0x00881403U
#define GPIO_90_SD1_C3                  0x00881407U
#define GPIO_90_EMIF1_RAS               0x00881409U
#define GPIO_90_SD4_C1                  0x0088140DU
#define GPIO_90_ESC_TX0_DATA3           0x0088140EU
#define GPIO_90_SPID_CLK                0x0088140FU

#define GPIO_91_GPIO91                  0x00881600U
#define GPIO_91_EPWM16_A                0x00881601U
#define GPIO_91_EMIF1_A18               0x00881602U
#define GPIO_91_EMIF1_DQM3              0x00881603U
#define GPIO_91_I2CA_SDA                0x00881606U
#define GPIO_91_SD4_D2                  0x00881607U
#define GPIO_91_EMIF1_DQM2              0x00881609U
#define GPIO_91_PMBUSA_SCL              0x0088160AU
#define GPIO_91_CLB_OUTPUTXBAR1         0x0088160EU
#define GPIO_91_SPID_PICO               0x0088160FU

#define GPIO_92_GPIO92                  0x00881800U
#define GPIO_92_EPWM16_B                0x00881801U
#define GPIO_92_EMIF1_A19               0x00881802U
#define GPIO_92_EMIF1_BA1               0x00881803U
#define GPIO_92_I2CA_SCL                0x00881806U
#define GPIO_92_SD4_C2                  0x00881807U
#define GPIO_92_EMIF1_DQM0              0x00881809U
#define GPIO_92_PMBUSA_SDA              0x0088180AU
#define GPIO_92_FSIRXD_CLK              0x0088180BU
#define GPIO_92_CLB_OUTPUTXBAR2         0x0088180EU
#define GPIO_92_SPID_POCI               0x0088180FU

#define GPIO_93_GPIO93                  0x00881A00U
#define GPIO_93_EPWM17_A                0x00881A01U
#define GPIO_93_EMIF1_BA0               0x00881A03U
#define GPIO_93_SD4_D3                  0x00881A07U
#define GPIO_93_PMBUSA_ALERT            0x00881A0AU
#define GPIO_93_ESC_TX1_CLK             0x00881A0BU
#define GPIO_93_CLB_OUTPUTXBAR3         0x00881A0EU
#define GPIO_93_SPID_CLK                0x00881A0FU

#define GPIO_94_GPIO94                  0x00881C00U
#define GPIO_94_EPWM17_B                0x00881C01U
#define GPIO_94_SD4_C3                  0x00881C07U
#define GPIO_94_EMIF1_BA1               0x00881C09U
#define GPIO_94_PMBUSA_CTL              0x00881C0AU
#define GPIO_94_ESC_TX1_ENA             0x00881C0BU
#define GPIO_94_CLB_OUTPUTXBAR4         0x00881C0EU
#define GPIO_94_SPID_PTE                0x00881C0FU

#define GPIO_95_GPIO95                  0x00881E00U
#define GPIO_95_EPWM18_A                0x00881E01U
#define GPIO_95_EQEP4_A                 0x00881E02U
#define GPIO_95_SD1_D1                  0x00881E06U
#define GPIO_95_ESC_GPO10               0x00881E0AU
#define GPIO_95_CLB_OUTPUTXBAR5         0x00881E0EU

#define GPIO_96_GPIO96                  0x00C60000U
#define GPIO_96_EPWM18_B                0x00C60001U
#define GPIO_96_EQEP4_B                 0x00C60002U
#define GPIO_96_EQEP1_A                 0x00C60005U
#define GPIO_96_SD1_C1                  0x00C60006U
#define GPIO_96_ESC_GPO11               0x00C6000AU
#define GPIO_96_CLB_OUTPUTXBAR6         0x00C6000EU

#define GPIO_97_GPIO97                  0x00C60200U
#define GPIO_97_EQEP4_STROBE            0x00C60202U
#define GPIO_97_EQEP1_B                 0x00C60205U
#define GPIO_97_SD1_D2                  0x00C60206U
#define GPIO_97_ESC_GPI17               0x00C6020AU
#define GPIO_97_CLB_OUTPUTXBAR7         0x00C6020EU

#define GPIO_98_GPIO98                  0x00C60400U
#define GPIO_98_EQEP4_INDEX             0x00C60402U
#define GPIO_98_EQEP1_STROBE            0x00C60405U
#define GPIO_98_SD1_C2                  0x00C60406U
#define GPIO_98_ESC_GPI18               0x00C6040AU
#define GPIO_98_CLB_OUTPUTXBAR8         0x00C6040EU

#define GPIO_99_GPIO99                  0x00C60600U
#define GPIO_99_EMIF1_DQM3              0x00C60602U
#define GPIO_99_EPWM8_A                 0x00C60603U
#define GPIO_99_EQEP1_INDEX             0x00C60605U
#define GPIO_99_SD4_D4                  0x00C60607U
#define GPIO_99_ESC_GPI21               0x00C6060AU
#define GPIO_99_EMIF1_D17               0x00C6060EU

#define GPIO_100_GPIO100                0x00C60800U
#define GPIO_100_SPIA_PICO              0x00C60801U
#define GPIO_100_EMIF1_BA1              0x00C60802U
#define GPIO_100_EPWM9_A                0x00C60803U
#define GPIO_100_EQEP2_A                0x00C60805U
#define GPIO_100_SPIC_PICO              0x00C60806U
#define GPIO_100_SD4_C4                 0x00C60807U
#define GPIO_100_SD1_D1                 0x00C60809U
#define GPIO_100_ESC_GPI0               0x00C6080AU
#define GPIO_100_FSIRXD_D1              0x00C6080BU
#define GPIO_100_FSITXA_D0              0x00C6080DU
#define GPIO_100_EMIF1_D24              0x00C6080EU

#define GPIO_101_GPIO101                0x00C60A00U
#define GPIO_101_EPWM18_A               0x00C60A01U
#define GPIO_101_EQEP2_B                0x00C60A05U
#define GPIO_101_SPIC_POCI              0x00C60A06U
#define GPIO_101_ESC_GPI1               0x00C60A0AU
#define GPIO_101_EMIF1_A5               0x00C60A0BU
#define GPIO_101_FSITXA_D1              0x00C60A0DU

#define GPIO_102_GPIO102                0x00C60C00U
#define GPIO_102_EPWM18_B               0x00C60C01U
#define GPIO_102_EQEP2_STROBE           0x00C60C05U
#define GPIO_102_SPIC_CLK               0x00C60C06U
#define GPIO_102_ESC_GPI2               0x00C60C0AU
#define GPIO_102_EMIF1_A6               0x00C60C0BU
#define GPIO_102_FSITXA_CLK             0x00C60C0DU

#define GPIO_103_GPIO103                0x00C60E00U
#define GPIO_103_EMIF1_BA0              0x00C60E02U
#define GPIO_103_EPWM8_B                0x00C60E03U
#define GPIO_103_EQEP2_INDEX            0x00C60E05U
#define GPIO_103_SPIC_PTE               0x00C60E06U
#define GPIO_103_SD4_C4                 0x00C60E07U
#define GPIO_103_ESC_GPI3               0x00C60E0AU
#define GPIO_103_FSIRXA_D0              0x00C60E0DU

#define GPIO_104_GPIO104                0x00C61000U
#define GPIO_104_I2CA_SDA               0x00C61001U
#define GPIO_104_EPWM18_A               0x00C61002U
#define GPIO_104_EQEP3_A                0x00C61005U
#define GPIO_104_SD3_D1                 0x00C61006U
#define GPIO_104_ESC_GPI4               0x00C6100AU
#define GPIO_104_FSIRXA_D1              0x00C6100DU
#define GPIO_104_ESC_SYNC0              0x00C6100EU

