t0biasm/embedded-project/platforms/c2000/mcal/f28p65/code/pin_map.h
#define GPIO_156_GPIO156                0x01081800U
#define GPIO_156_EPWM6_B                0x01081801U
#define GPIO_156_ESC_GPO23              0x0108180AU
#define GPIO_156_FSIRXA_CLK             0x0108180DU
#define GPIO_156_ESC_TX0_ENA            0x0108180EU

#define GPIO_157_GPIO157                0x01081A00U
#define GPIO_157_EPWM7_A                0x01081A01U
#define GPIO_157_ESC_GPO24              0x01081A0AU
#define GPIO_157_FSITXB_D0              0x01081A0DU
#define GPIO_157_ESC_TX0_CLK            0x01081A0EU

#define GPIO_158_GPIO158                0x01081C00U
#define GPIO_158_EPWM7_B                0x01081C01U
#define GPIO_158_ESC_GPO25              0x01081C0AU
#define GPIO_158_FSITXB_D1              0x01081C0DU
#define GPIO_158_ESC_TX0_DATA0          0x01081C0EU

#define GPIO_159_GPIO159                0x01081E00U
#define GPIO_159_EPWM8_A                0x01081E01U
#define GPIO_159_ESC_GPO26              0x01081E0AU
#define GPIO_159_FSITXB_CLK             0x01081E0DU
#define GPIO_159_ESC_TX0_DATA1          0x01081E0EU

#define GPIO_160_GPIO160                0x01460000U
#define GPIO_160_EPWM8_B                0x01460001U
#define GPIO_160_ESC_GPO27              0x0146000AU
#define GPIO_160_FSIRXB_D0              0x0146000DU
#define GPIO_160_ESC_TX0_DATA2          0x0146000EU

#define GPIO_161_GPIO161                0x01460200U
#define GPIO_161_EPWM9_A                0x01460201U
#define GPIO_161_ESC_GPO28              0x0146020AU
#define GPIO_161_FSIRXB_D1              0x0146020DU
#define GPIO_161_ESC_TX0_DATA3          0x0146020EU

#define GPIO_162_GPIO162                0x01460400U
#define GPIO_162_EPWM9_B                0x01460401U
#define GPIO_162_ESC_GPO29              0x0146040AU
#define GPIO_162_FSIRXB_CLK             0x0146040DU
#define GPIO_162_ESC_RX0_DV             0x0146040EU

#define GPIO_163_GPIO163                0x01460600U
#define GPIO_163_EPWM10_A               0x01460601U
#define GPIO_163_ESC_GPO30              0x0146060AU
#define GPIO_163_FSIRXC_D0              0x0146060DU
#define GPIO_163_ESC_RX0_CLK            0x0146060EU

#define GPIO_164_GPIO164                0x01460800U
#define GPIO_164_EPWM10_B               0x01460801U
#define GPIO_164_ESC_GPO31              0x0146080AU
#define GPIO_164_FSIRXC_D1              0x0146080DU
#define GPIO_164_ESC_RX0_ERR            0x0146080EU

#define GPIO_165_GPIO165                0x01460A00U
#define GPIO_165_EPWM11_A               0x01460A01U
#define GPIO_165_FSIRXC_CLK             0x01460A0DU
#define GPIO_165_ESC_RX0_DATA0          0x01460A0EU

#define GPIO_166_GPIO166                0x01460C00U
#define GPIO_166_EPWM11_B               0x01460C01U
#define GPIO_166_FSIRXD_D0              0x01460C0DU
#define GPIO_166_ESC_RX0_DATA1          0x01460C0EU

#define GPIO_167_GPIO167                0x01460E00U
#define GPIO_167_EPWM12_A               0x01460E01U
#define GPIO_167_FSIRXD_D1              0x01460E0DU
#define GPIO_167_ESC_RX0_DATA2          0x01460E0EU

#define GPIO_168_GPIO168                0x01461000U
#define GPIO_168_EPWM12_B               0x01461001U
#define GPIO_168_FSIRXD_CLK             0x0146100DU
#define GPIO_168_ESC_RX0_DATA3          0x0146100EU

#define GPIO_169_GPIO169                0x01461200U

#define GPIO_170_GPIO170                0x01461400U

#define GPIO_171_GPIO171                0x01461600U

#define GPIO_172_GPIO172                0x01461800U

#define GPIO_173_GPIO173                0x01461A00U

#define GPIO_174_GPIO174                0x01461C00U

#define GPIO_175_GPIO175                0x01461E00U

#define GPIO_176_GPIO176                0x01480000U

#define GPIO_177_GPIO177                0x01480200U

#define GPIO_178_GPIO178                0x01480400U

#define GPIO_179_GPIO179                0x01480600U

#define GPIO_180_GPIO180                0x01480800U

#define GPIO_181_GPIO181                0x01480A00U

#define GPIO_182_GPIO182                0x01480C00U

#define GPIO_183_GPIO183                0x01480E00U

#define GPIO_184_GPIO184                0x01481000U

#define GPIO_185_GPIO185                0x01481200U

#define GPIO_186_GPIO186                0x01481400U

#define GPIO_187_GPIO187                0x01481600U

#define GPIO_188_GPIO188                0x01481800U

#define GPIO_189_GPIO189                0x01481A00U

#define GPIO_190_GPIO190                0x01481C00U

#define GPIO_191_GPIO191                0x01481E00U

#define GPIO_192_GPIO192                0x01860000U

#define GPIO_193_GPIO193                0x01860200U

#define GPIO_194_GPIO194                0x01860400U

#define GPIO_195_GPIO195                0x01860600U

#define GPIO_196_GPIO196                0x01860800U

#define GPIO_197_GPIO197                0x01860A00U

#define GPIO_198_GPIO198                0x01860C00U
#define GPIO_198_EQEP1_A                0x01860C01U
#define GPIO_198_EPWM9_B                0x01860C02U
#define GPIO_198_SPIA_PICO              0x01860C03U
#define GPIO_198_ESC_PDI_UC_IRQ         0x01860C0EU

#define GPIO_199_GPIO199                0x01860E00U
#define GPIO_199_EQEP1_STROBE           0x01860E01U
#define GPIO_199_EPWM17_A               0x01860E02U
#define GPIO_199_SCIB_TX                0x01860E03U
#define GPIO_199_EPWM12_A               0x01860E05U
#define GPIO_199_SPIB_CLK               0x01860E06U
#define GPIO_199_SD1_D4                 0x01860E07U
#define GPIO_199_MCANA_TX               0x01860E09U
#define GPIO_199_EMIF1_RAS              0x01860E0AU
#define GPIO_199_SPIC_CLK               0x01860E0EU

#define GPIO_200_GPIO200                0x01861000U
#define GPIO_200_EQEP1_INDEX            0x01861001U
#define GPIO_200_EPWM17_B               0x01861002U
#define GPIO_200_SCIB_RX                0x01861003U
#define GPIO_200_EPWM12_B               0x01861005U
#define GPIO_200_SPIB_PTE               0x01861006U
#define GPIO_200_SD1_C4                 0x01861007U
#define GPIO_200_MCANA_RX               0x01861009U
#define GPIO_200_EMIF1_CAS              0x0186100AU
#define GPIO_200_ESC_TX1_DATA1          0x0186100BU
#define GPIO_200_SPIC_PTE               0x0186100EU

#define GPIO_201_GPIO201                0x01861200U
#define GPIO_201_OUTPUTXBAR1            0x01861201U
#define GPIO_201_EQEP2_A                0x01861202U
#define GPIO_201_EPWM18_A               0x01861203U
#define GPIO_201_LINB_TX                0x01861205U
#define GPIO_201_SPIB_PICO              0x01861206U
#define GPIO_201_SD2_D1                 0x01861207U
#define GPIO_201_PMBUSA_SCL             0x01861209U
#define GPIO_201_EMIF1_DQM0             0x0186120AU
#define GPIO_201_ESC_TX1_DATA2          0x0186120BU
#define GPIO_201_EPWM13_A               0x0186120DU

#define GPIO_202_GPIO202                0x01861400U
#define GPIO_202_OUTPUTXBAR2            0x01861401U
#define GPIO_202_EQEP2_B                0x01861402U
#define GPIO_202_EPWM18_B               0x01861403U
#define GPIO_202_LINB_RX                0x01861405U
#define GPIO_202_SPIB_POCI              0x01861406U
#define GPIO_202_SD2_C1                 0x01861407U
#define GPIO_202_PMBUSA_SDA             0x01861409U
#define GPIO_202_EMIF1_DQM1             0x0186140AU
#define GPIO_202_ESC_TX1_DATA3          0x0186140BU
#define GPIO_202_EPWM13_B               0x0186140DU
#define GPIO_202_FSITXA_D1              0x0186140EU

#define GPIO_203_GPIO203                0x01861600U
#define GPIO_203_OUTPUTXBAR3            0x01861601U
#define GPIO_203_EQEP2_INDEX            0x01861602U
#define GPIO_203_SPIA_POCI              0x01861603U
#define GPIO_203_SPIB_CLK               0x01861606U
#define GPIO_203_SD3_D1                 0x01861607U
#define GPIO_203_PMBUSA_ALERT           0x01861609U
#define GPIO_203_EMIF1_DQM2             0x0186160AU
#define GPIO_203_ESC_MDIO_CLK           0x0186160BU
#define GPIO_203_EPWM14_A               0x0186160DU
#define GPIO_203_FSITXA_D0              0x0186160EU
#define GPIO_203_EPWM8_B                0x0186160FU

